{
  "architectures": [
    "BlueLMForCausalLM"
  ],
  "auto_map": {
    "AutoConfig": "configuration_bluelm.BlueLMConfig",
    "AutoModelForCausalLM": "modeling_bluelm.BlueLMForCausalLM"
  },
  "bos_token_id": 1,
  "eos_token_id": 2,
  "hidden_act": "silu",
  "hidden_size": 4096,
  "initializer_range": 0.02,
  "intermediate_size": 11008,
  "max_position_embeddings": 2048,
  "model_type": "BlueLM",
  "num_attention_heads": 32,
  "num_hidden_layers": 32,
  "num_key_value_heads": 32,
  "pad_token_id": 3,
  "pretraining_tp": 1,
  "rms_norm_eps": 1e-06,
  "rope_scaling": null,
  "rope_theta": 10000.0,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.30.1",
  "use_cache": true,
  "use_stable_embedding": true,
  "vocab_size": 100008
}
